In [1]:
import numpy as np
import pandas as pd 
from pandas import Series,DataFrame

In [3]:
ser1 = Series([2,np.nan,4,np.nan,6,np.nan],
             index=['Q','R','S','T','U','V'])
ser1

Q    2.0
R    NaN
S    4.0
T    NaN
U    6.0
V    NaN
dtype: float64

In [5]:
ser2 = Series(np.arange(len(ser1)),dtype=np.float64,
             index=['Q','R','S','T','U','V'])
ser2

Q    0.0
R    1.0
S    2.0
T    3.0
U    4.0
V    5.0
dtype: float64

In [13]:
Series(np.where(pd.isnull(ser1),ser2,ser1),index=ser1.index)

Q    2.0
R    1.0
S    4.0
T    3.0
U    6.0
V    5.0
dtype: float64

In [15]:
nan = np.nan

In [11]:
ser1.combine_first(ser2)

Q    2.0
R    1.0
S    4.0
T    3.0
U    6.0
V    5.0
dtype: float64

In [29]:
dframe_odds = DataFrame({'x':[1,nan,3,nan],
                        'y':[5,nan,7,nan],
                        'z':[9,nan,11,nan]})
dframe_odds

     x    y     z
0  1.0  5.0   9.0
1  NaN  NaN   NaN
2  3.0  7.0  11.0
3  NaN  NaN   NaN

In [25]:
dframe_evens = DataFrame({'x':[2,4,6,nan,8],
                         'y':[nan,12,14,16,nan]})
dframe_evens

     x     y
0  2.0   NaN
1  4.0  12.0
2  6.0  14.0
3  NaN  16.0
4  8.0   NaN

In [31]:
dframe_odds.combine_first(dframe_evens)

     x     y     z
0  1.0   5.0   9.0
1  4.0  12.0   NaN
2  3.0   7.0  11.0
3  NaN  16.0   NaN
4  8.0   NaN   NaN